---
kind: enumMember
id: F:Autodesk.Revit.DB.MeshFromGeometryOperationIssue.NoUsableCurveLoopsInInput
enum: Autodesk.Revit.DB.MeshFromGeometryOperationIssue
source: html/6c89d542-b05c-bbbf-eb8d-e291d71865d0.htm
---
# Autodesk.Revit.DB.MeshFromGeometryOperationIssue.NoUsableCurveLoopsInInput

While one or more curve loops were expected as one of the input
 parameters while building a mesh, no loops containing curves were
 provided.